In [1]:
import pandas as pd
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [2]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [3]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [4]:
df_one['k1'].unique()

array(['A', 'B', 'C'], dtype=object)

In [5]:
# Display number of unique values on the column
df_one['col2'].nunique()

5

In [6]:
df_one['k1'].nunique()

3

In [7]:
df_one['k1'].value_counts()

A    2
B    2
C    2
Name: k1, dtype: int64

In [9]:
# Delete duplciate entries
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [12]:
# Multiply col1 by 10 and add it on another column
df_one['New'] = df_one['col1'] * 1000
df_one

  k1  col1 col2     New
0  A   100   NY  100000
1  A   200   CA  200000
2  B   300   WA  300000
3  B   300   WA  300000
4  C   400   AK  400000
5  C   500   NV  500000

In [ ]:
# Grabbing the first letter of col2